# GetCentralModelName Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
LinkLoadResult..::..GetCentralModelName Method
LinkLoadResult Class See Also
---
Gets the central model's name. If the link is not workshared, this returns an empty FilePath. If the link is itself a central model, this returns the link's name.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public ModelPath GetCentralModelName()
```

Visual Basic
---
```text
Public Function GetCentralModelName As ModelPath
```

Visual C++
---
```text
public:
ModelPath^ GetCentralModelName()
```

# Remarks
If the link could not be found or loaded, this name may be blank. This function is only relevant for LinkLoadResult object for RvtLinkSymbol. ie. when getIsRvtLink() is true.
# See Also
LinkLoadResult Class
Autodesk.Revit.DB Namespace